In [1]:
import pandas as pd
df = pd.DataFrame([[1, "Ram", "IT"], [2, "Shyam", "Ops"]], columns = ["emp_id", "name", "dept"])
df

   emp_id   name dept
0       1    Ram   IT
1       2  Shyam  Ops

In [2]:
df = pd.DataFrame([[1, "Ram", "IT"]], columns = ["emp_id", "name", "dept"])

In [3]:
df

   emp_id name dept
0       1  Ram   IT

In [4]:

# Dot product
import time
import numpy
import array
  
# 8 bytes size int
a = array.array('q')
for i in range(100000):
    a.append(i);
  
b = array.array('q')
for i in range(100000, 200000):
    b.append(i)
  
# classic dot product of vectors implementation 
tic = time.process_time()
dot = 0.0;
  
for i in range(len(a)):
      dot += a[i] * b[i]
  
toc = time.process_time()
  
print("dot_product = "+ str(dot));
print("Computation time = " + str(1000*(toc - tic )) + "ms")
   
  
n_tic = time.process_time()
n_dot_product = numpy.dot(a, b)
n_toc = time.process_time()
  
print("\nn_dot_product = "+str(n_dot_product))
print("Computation time = "+str(1000*(n_toc - n_tic ))+"ms")

dot_product = 833323333350000.0
Computation time = 31.25ms

n_dot_product = 833323333350000
Computation time = 0.0ms

In [5]:
a = array.array('q')
a

array('q')

In [6]:
import numpy as np
string="anu hi what are you doing anu hi you"
#split string to list based on delimiter
series=string.split(" ")
series

['anu', 'hi', 'what', 'are', 'you', 'doing', 'anu', 'hi', 'you']

In [7]:
df=pd.DataFrame(series,columns=['name'])

In [8]:
df5=    df.groupby(['name']).size()
df5

name
anu      2
are      1
doing    1
hi       2
what     1
you      2
dtype: int64

In [9]:
df5.sort_index(inplace=True)

In [10]:
df5

name
anu      2
are      1
doing    1
hi       2
what     1
you      2
dtype: int64

In [11]:
df6=pd.DataFrame({'company':['apple','google','apple','amazon'],'name':['anu','money','honey','gunny']})
df6

  company   name
0   apple    anu
1  google  money
2   apple  honey
3  amazon  gunny

In [12]:
 df6.groupby(['company']).agg({ 'name':pd.Series.nunique})

         name
company
amazon      1
apple       2
google      1

In [15]:
 df6.groupby(['company']).agg({'name':pd.Series})

                 name
company
amazon          gunny
apple    [anu, honey]
google          money

In [17]:
s="How much wood would a woodchuck chuck if a woodchuck could chuck wood"
ls=s.split(" ")
df4=pd.DataFrame(ls,columns=['name'])
df3=df4.groupby(['name']).size()
df3

name
How          1
a            2
chuck        2
could        1
if           1
much         1
wood         2
woodchuck    2
would        1
dtype: int64

In [18]:
df3.sort_index( ascending=True)

name
How          1
a            2
chuck        2
could        1
if           1
much         1
wood         2
woodchuck    2
would        1
dtype: int64

In [19]:
pd.Series(s.split(" ")).value_counts().sort_index()

How          1
a            2
chuck        2
could        1
if           1
much         1
wood         2
woodchuck    2
would        1
dtype: int64

In [20]:
df=df6.copy()
for x in df.columns:
    if df[x].nunique()==1:
        df.drop(x, axis=1, inplace=True)

In [21]:
df.columns

Index(['company', 'name'], dtype='object')

In [22]:
df['company']

0     apple
1    google
2     apple
3    amazon
Name: company, dtype: object

In [23]:
df['company'].nunique()

3

In [24]:
df6

  company   name
0   apple    anu
1  google  money
2   apple  honey
3  amazon  gunny

In [25]:
df.drop('name', axis=1)

  company
0   apple
1  google
2   apple
3  amazon

In [26]:
df.insert(1,'name2',['anu','money','honey','gunny'])

In [27]:
df

  company  name2   name
0   apple    anu    anu
1  google  money  money
2   apple  honey  honey
3  amazon  gunny  gunny

In [28]:
df=pd.read_csv(r"C:\Users\Tnluser\Downloads\data.csv")
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [29]:
df2=pd.read_csv(r"C:\Users\Tnluser\Downloads\mtcars.csv",index_col='model')
df2.head()

,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
model,,,,,,,,,,,
Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

In [ ]:
df[['tip','total_bill','size']].head()

In [30]:
df.loc[:2,"tip":
          "size"]

    tip     sex smoker  day    time  size
0  1.01  Female     No  Sun  Dinner     2
1  1.66    Male     No  Sun  Dinner     3
2  3.50    Male     No  Sun  Dinner     3

In [31]:
df.iloc[:2,:]

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3

In [32]:
pd.DataFrame(df,columns=['tip','total_bill','size']).head()

    tip  total_bill  size
0  1.01       16.99     2
1  1.66       10.34     3
2  3.50       21.01     3
3  3.31       23.68     2
4  3.61       24.59     4

In [33]:
df.iloc[:,[1,2,3]].head()

    tip     sex smoker
0  1.01  Female     No
1  1.66    Male     No
2  3.50    Male     No
3  3.31    Male     No
4  3.61  Female     No

In [34]:
df1=pd.DataFrame({'name':["Sam","Roma","Mark"], "profession":['dev','mle','Data scientist'],"gender":['male','female','male'], "age":[21,20,25],"review":['No comments','hardworker','need improvement'],"rating":[10,5,7]})

In [35]:
df1

   name      profession  gender  age            review  rating
0   Sam             dev    male   21       No comments      10
1  Roma             mle  female   20        hardworker       5
2  Mark  Data scientist    male   25  need improvement       7

In [40]:
df1.loc[:,:]

   name      profession  gender  age            review  rating
0   Sam             dev    male   21       No comments      10
1  Roma             mle  female   20        hardworker       5
2  Mark  Data scientist    male   25  need improvement       7

In [44]:
df1.index[df1.name=='Roma'].tolist()

[1]

In [45]:
df1.drop(df1.index[df1.name=='Sam'].tolist(),axis=0)

   name      profession  gender  age            review  rating
1  Roma             mle  female   20        hardworker       5
2  Mark  Data scientist    male   25  need improvement       7

In [37]:
df1.loc[:,['name','profession']]

   name      profession
0   Sam             dev
1  Roma             mle
2  Mark  Data scientist

In [ ]:
ls=[['anu','analyst','female','30','good',9],['money','analyst','female','30','good',9]]

In [ ]:
df0=pd.DataFrame(ls,columns=df1.columns)
df0

In [ ]:
df=pd.concat([df1,df0]).reset_index()
df

In [ ]:
df.drop(index=3,inplace=True)

In [ ]:
df

In [ ]:
df1[df1['rating']>=6].iloc[:,1:4]

In [46]:
df9=pd.read_csv(r"C:\Users\Tnluser\Downloads\titanic.csv")
df9.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,adult_male,embark_town,pclass_1,price,gender
0,1,3,female,26.0,0,0,7.9250,S,Third,False,Southampton,3,7.9250,female
1,1,1,female,38.0,1,0,71.2833,C,First,False,Cherbourg,1,71.2833,female
2,1,3,female,26.0,0,0,7.9250,S,Third,False,Southampton,3,7.9250,female
3,0,3,male,NaN,0,0,8.4583,Q,Third,True,Queenstown,3,8.4583,male
4,1,2,female,14.0,1,0,30.0708,C,Second,False,Cherbourg,2,30.0708,female

In [51]:
df9.loc[:,'sex':'fare'].shape

(10, 5)

In [54]:
df9.loc[:,'sex':'fare'].drop_duplicates(keep='first').shape

(6, 5)

In [56]:
df9.loc[:,'sex':'fare'].drop_duplicates(subset=['sex'],keep='first').shape

(2, 5)

In [ ]:
df9.T.drop_duplicates(keep='first').head()

In [ ]:
df9.drop_duplicates(keep='first')

In [ ]:
df9.drop_duplicates(keep='last')

In [ ]:
df_A=pd.DataFrame({'name': ['a', 'b', 'c'], 'age': [12, 15, 18]})
ls=[['d', 20], ['e', 21], ['f', 22]]
out=4

In [ ]:
df_B=pd.concat([df_A,pd.DataFrame(ls,columns=df_A.columns)],ignore_index=True)
df_B

In [ ]:
df_B['name'].is_unique

In [ ]:
df_B[df_B.where(df_B['name']=='a')]

In [58]:
df=pd.DataFrame({'Name':["Sam","Mark","Client",'Sam','Tiger','Sam'],
                 'employment_type':['fte','fte','intern','fte','freelancer','fte'],
                 'department':['people','marketing','marketing','tech','marketing','tech'],
                'p_id':[1,2,3,1,4,1]})
df.head()

     Name employment_type department  p_id
0     Sam             fte     people     1
1    Mark             fte  marketing     2
2  Client          intern  marketing     3
3     Sam             fte       tech     1
4   Tiger      freelancer  marketing     4

In [60]:
df.shape

(6, 4)

In [61]:
df.drop_duplicates(subset=['p_id'],keep='last',inplace=True)

In [62]:
df

     Name employment_type department  p_id
1    Mark             fte  marketing     2
2  Client          intern  marketing     3
4   Tiger      freelancer  marketing     4
5     Sam             fte       tech     1

In [63]:
df.shape

(4, 4)

In [65]:
df.drop(['p_id'],axis=1,inplace=True)

In [68]:
df.reset_index()

   index    Name employment_type department
0      1    Mark             fte  marketing
1      2  Client          intern  marketing
2      4   Tiger      freelancer  marketing
3      5     Sam             fte       tech

In [72]:
df.index[df.Name=='Mark'].to_list()

[1]

In [74]:
df.drop(df.index[df.Name=='Mark'].to_list(),axis=0, inplace=True)

In [75]:
df

     Name employment_type department
2  Client          intern  marketing
4   Tiger      freelancer  marketing
5     Sam             fte       tech